tfmalt/esp32-led-bookshelf/lib/Effects/Effects.cpp

#include "Effects.h"

#if defined(FFT_ACTIVE) && defined(IS_TEENSY)
#include <AudioFFT.h>
AudioFFT fft;
#endif

#if defined(FFT_ACTIVE) && defined(IS_ESP32)
#include <Esp32FFT.h>
Esp32FFT fft;
#endif

DEFINE_GRADIENT_PALETTE(Paired_07_gp){
    0,   83,  159, 190, 36,  83,  159, 190, 36,  1,   48,  106, 72,  1,
    48,  106, 72,  100, 189, 54,  109, 100, 189, 54,  109, 3,   91,  3,
    145, 3,   91,  3,   145, 244, 84,  71,  182, 244, 84,  71,  182, 188,
    1,   1,   218, 188, 1,   1,   218, 249, 135, 31,  255, 249, 135, 31};

DEFINE_GRADIENT_PALETTE(bhw1_05_gp){0, 1, 221, 53, 255, 73, 3, 178};
DEFINE_GRADIENT_PALETTE(RdYlBu_gp){
    0,   82, 0,   2,   31,  163, 6,   2,   63,  227, 39,  9,  95,  249,
    109, 22, 127, 252, 191, 61,  127, 182, 229, 237, 159, 90, 178, 203,
    191, 32, 108, 155, 223, 8,   45,  106, 255, 3,   8,   66};

DEFINE_GRADIENT_PALETTE(Sunset_Real_gp){
    0,  120, 0,   0,   22, 179, 22,  0,  51, 255, 104, 0, 85, 167,
    22, 18,  135, 100, 0,  103, 198, 16, 0,  130, 255, 0, 0,  160};

DEFINE_GRADIENT_PALETTE(summer_gp){
    0,   0,   55,  25, 17,  1,   62,  25, 33,  1,   72,  25, 51,  3,   82,  25,
    68,  8,   92,  25, 84,  14,  104, 25, 102, 23,  115, 25, 119, 35,  127, 25,
    135, 48,  141, 25, 153, 67,  156, 25, 170, 88,  169, 25, 186, 112, 186, 25,
    204, 142, 201, 25, 221, 175, 217, 25, 237, 210, 235, 25, 255, 255, 255, 25};

DEFINE_GRADIENT_PALETTE(gr65_hult_gp){0,   247, 176, 247, 48,  255, 136, 255,
                                      89,  220, 29,  226, 160, 7,   82,  178,
                                      216, 1,   124, 109, 255, 1,   124, 109};

void Effects::setup() {
#ifdef DEBUG
  Serial.println("  - Running Effects Setup");
#endif
#if defined(FFT_ACTIVE) && defined(IS_ESP32)
  fft.setup();
//   analogReadResolution(12);
//   analogSetCycles(8);
//   analogSetSamples(1);
//   analogSetAttenuation(ADC_11db);
#endif
}

void Effects::setLightStateController(LightStateController* l) {
  lightState = l;
}

void Effects::setCommandFrames(uint16_t i) { commandFrames = i; }

void Effects::setCurrentCommand(Command cmd) {
  LightState state = lightState->getCurrentState();
  commandFrameCount = 0;
  commandStart = millis();
  currentCommandType = cmd;

  setCommandFrames(FPS * (state.transition || 1));

  switch (cmd) {
    case Command::Brightness:
      currentCommand = &Effects::cmdSetBrightness;
      break;
    case Command::Color:
      currentCommand = &Effects::cmdFadeTowardColor;
      break;
    case Command::FirmwareUpdate:
      currentCommand = &Effects::cmdFirmwareUpdate;
      break;
    default:
      currentCommand = &Effects::cmdEmpty;
      currentCommandType = Command::None;
  }
}

void Effects::setCurrentEffect(String effect) {
#ifdef DEBUG
  Serial.printf("  - Effects: Setting new effect: %s\n", effect.c_str());
#endif

  fill_solid(leds, LED_COUNT, CRGB::Black);
  setCurrentEffect(getEffectFromString(effect));
}

Effects::Effect Effects::getEffectFromString(String str) {
  if (str == "Glitter Rainbow") return Effect::GlitterRainbow;
  if (str == "Rainbow") return Effect::Rainbow;
  if (str == "Gradient") return Effect::Gradient;
  if (str == "RainbowByShelf") return Effect::RainbowByShelf;
  if (str == "BPM") return Effect::BPM;
  if (str == "Confetti") return Effect::Confetti;
  if (str == "Juggle") return Effect::Juggle;
  if (str == "Sinelon") return Effect::Sinelon;
  if (str == "VUMeter") return Effect::VUMeter;
  if (str == "Frequencies") return Effect::Frequencies;
  if (str == "Music Dancer") return Effect::MusicDancer;
  if (str == "Pride") return Effect::Pride;
  if (str == "Colorloop") return Effect::Colorloop;
  if (str == "Walking Rainbow") return Effect::WalkingRainbow;

  return Effect::NullEffect;
}

void Effects::setCurrentEffect(Effect effect) {
  LightState state = lightState->getCurrentState();
  currentEffectType = effect;

  switch (effect) {
    case Effect::GlitterRainbow:
      currentEffect = &Effects::effectGlitterRainbow;
      break;
    case Effect::Rainbow:
      currentEffect = &Effects::effectRainbow;
      break;
    case Effect::Gradient:
      currentEffect = &Effects::effectGradient;
      break;
    case Effect::RainbowByShelf:
      currentEffect = &Effects::effectRainbowByShelf;
      break;
    case Effect::BPM:
      currentEffect = &Effects::effectBPM;
      break;
    case Effect::Pride:
      currentEffect = &Effects::effectPride;
      break;
    case Effect::Colorloop:
      currentEffect = &Effects::effectColorloop;
      break;
    case Effect::WalkingRainbow:
      currentEffect = &Effects::effectWalkingRainbow;
      break;
    case Effect::VUMeter:
      currentEffect = &Effects::effectVUMeter;
      break;
    case Effect::MusicDancer:
      currentEffect = &Effects::effectMusicDancer;
      break;
    case Effect::Frequencies:
      currentEffect = &Effects::effectFrequencies;
      break;
    case Effect::Confetti:
      currentEffect = &Effects::effectConfetti;
      break;
    case Effect::Sinelon:
      currentEffect = &Effects::effectSinelon;
      break;
    case Effect::Juggle:
      currentEffect = &Effects::effectJuggle;
      break;
    default:
      currentEffectType = Effect::NullEffect;
      currentEffect = &Effects::cmdEmpty;
  }
}

void Effects::runCurrentCommand() { (this->*currentCommand)(); }

void Effects::runCurrentEffect() { (this->*currentEffect)(); }

void Effects::cmdEmpty() {}

void Effects::cmdFirmwareUpdate() {
  fill_solid(leds, LED_COUNT, CRGB::Black);
  // fill_solid(leds, 15, CRGB::White);
  leds[3] = CRGB::White;
  leds[7] = CRGB::White;
  leds[11] = CRGB::White;
  leds[15] = CRGB::White;
  leds[16] = CRGB::White;

  FastLED.show();
}

void Effects::cmdSetBrightness() {
  LightState state = lightState->getCurrentState();

  uint8_t target = state.brightness;
  uint8_t current = FastLED.getBrightness();

  EVERY_N_MILLIS(1000 / FPS) {
    if (commandFrameCount < commandFrames) {
      FastLED.setBrightness(
          current + ((target - current) / (commandFrames - commandFrameCount)));
      commandFrameCount++;
    } else {
#ifdef DEBUG
      Serial.printf("  - command: setting brightness DONE [%i] %lu ms.\n",
                    FastLED.getBrightness(), (millis() - commandStart));
#endif

      setCurrentCommand(Command::None);
    }
  }
}

/**
 * Helper function that blends one uint8_t toward another by a given amount
 * Taken from:
 * https://gist.github.com/kriegsman/d0a5ed3c8f38c64adcb4837dafb6e690
 */
void Effects::nblendU8TowardU8(uint8_t& cur, const uint8_t target,
                               uint8_t amount) {
  if (cur == target) return;

  if (cur < target) {
    uint8_t delta = target - cur;
    delta = scale8_video(delta, amount);
    cur += delta;
  } else {
    uint8_t delta = cur - target;
    delta = scale8_video(delta, amount);
    cur -= delta;
  }
}

/**
 * Blend one CRGB color toward another CRGB color by a given amount.
 * Blending is linear, and done in the RGB color space.
 * This function modifies 'cur' in place.
 * Taken from:
 * https://gist.github.com/kriegsman/d0a5ed3c8f38c64adcb4837dafb6e690
 */
CRGB Effects::fadeTowardColor(CRGB& cur, const CRGB& target, uint8_t amount) {
  nblendU8TowardU8(cur.red, target.red, amount);
  nblendU8TowardU8(cur.green, target.green, amount);
  nblendU8TowardU8(cur.blue, target.blue, amount);
  return cur;
}

/**
 * Fade an entire array of CRGBs toward a given background color by a given
 * amount This function modifies the pixel array in place. Taken from:
 * https://gist.github.com/kriegsman/d0a5ed3c8f38c64adcb4837dafb6e690
 */
void Effects::fadeTowardColor(CRGB* L, uint16_t N, const CRGB& bgColor,
                              uint8_t fadeAmount) {
  uint16_t check = 0;
  EVERY_N_MILLIS(4) {
    for (uint16_t i = 0; i < N; i++) {
      fadeTowardColor(L[i], bgColor, fadeAmount);
      if (L[i] == bgColor) check++;
    }
  }

  if (check == numberOfLeds) {
#ifdef DEBUG
    Serial.printf("  - fade towards color done in %lu ms.\n",
                  (millis() - commandStart));
#endif
    setCurrentCommand(Command::None);
  }
}

/**
 * command tells strip to Fade towards a color
 */
void Effects::cmdFadeTowardColor() {
  LightState state = lightState->getCurrentState();
  CRGB targetColor(state.color.r, state.color.g, state.color.b);

