tfmalt/esp32-led-bookshelf/lib/Effects/Effects.cpp
  fadeTowardColor(leds, numberOfLeds, targetColor, 2);
}

/**
 * setLeds
 */
void Effects::setLeds(CRGB* l, const uint16_t& n) {
  numberOfLeds = n;
  leds = l;
}

/**
 * Return current effect
 *
 * @return Effects::Effect current effect type
 */
Effects::Effect Effects::getCurrentEffect() {
  // returns current effect
  return currentEffectType;
}

/**
 * Sets the start hue
 */
void Effects::setStartHue(float hue) {
  startHue = static_cast<uint8_t>(hue * (256.0 / 360.0));
  confettiHue = startHue;
}

// ======================================================================
// FFT Helper functions
// ======================================================================

// unsigned long newtime = 0;
// unsigned long oldtime = 0;
// unsigned long sampling_period = round(1000000 * (1.0 / SAMPLING_FREQUENCY));

// unsigned long Effects::sampleDelay() {
//   newtime = micros() - oldtime;
//   oldtime = newtime;
//
//   return (newtime + sampling_period);
// }

// 5 per second for 20 seconds

// #define AVG_MAX 200
// #define AVG_BASE 2047
// #define FFT_LOW_CUTOFF 32000
// #define FFT_HIGH_CUTOFF 320000
//
// uint16_t AVG_SAMP[AVG_MAX];
// uint32_t AVG_CTR = 0;
// double AMP_FACTOR = 1.00;

// void Effects::fftComputeSampleset() {
//   // unsigned long start = micros();
//   uint16_t sample;
//
//   for (int i = 0; i < FFT_SAMPLES; i++) {
//     sample = analogRead(FFT_INPUT_PIN);
//
//     EVERY_N_MILLIS(200) {
//       AVG_SAMP[(AVG_CTR % AVG_MAX)] = sample;
//       AVG_CTR++;
//     }
//
//     int adjusted = (int)(sample * AMP_FACTOR);
//     if (adjusted < 0) adjusted = 0;
//     if (adjusted > 4095) adjusted = 4095;
//
//     vReal[i] = adjusted;
//     vImag[i] = 0;
//   }
//   // unsigned long doneSamples = micros();
//
//   FFT.Windowing(vReal, FFT_SAMPLES, FFT_WIN_TYP_HAMMING, FFT_FORWARD);
//   FFT.Compute(vReal, vImag, FFT_SAMPLES, FFT_FORWARD);
//   FFT.ComplexToMagnitude(vReal, vImag, FFT_SAMPLES);
//   // unsigned long doneCompute = micros();
//
//   EVERY_N_MILLIS(1000) {
//     // Calculate average amplitude every 5 seconds.
//     uint32_t avg_sum = 0;
//     for (int i = 0; i < AVG_MAX; i++) {
//       avg_sum += AVG_SAMP[i];
//     }
//
//     double avg =
//         (AVG_CTR > 200) ? avg_sum / (double)AVG_MAX : avg_sum /
//         (double)AVG_CTR;
//     AMP_FACTOR = (avg > 0) ? AVG_BASE / avg : 0;
//
// #ifdef DEBUG
//     Serial.printf("Average: raw: %6i\t avg: %8.2f\tfac: %8.2f\tadj: %6i\n",
//                   sample, avg, AMP_FACTOR, (int)(avg * AMP_FACTOR));
// #endif
//   }
// }

// void Effects::fftFillBuckets() {
//   int next = 0;
//   int prev = 0;
//   int curr = 0;
//
//   // ====================================================================
//   // 0: Bass: 60 - 250 Hz
//   curr = (int)vReal[2];
//   next = (int)vReal[3];
//
//   if (next > (curr * 2.19)) curr = 0;
//
//   //  Serial.printf("%6i\t%6i\t%6i\t", prev, curr, next);
//
//   curr -= FFT_LOW_CUTOFF;
//   if (curr < 0) curr = 0;
//
//   curr = constrain(curr, 0, FFT_HIGH_CUTOFF);
//   curr = map(curr, 0, FFT_HIGH_CUTOFF, 0, 255);
//
//   buckets[0] = (uint8_t)curr;
//
//   // ====================================================================
//   // 1: Low midrange: 250 - 500 Hz
//   curr = 0;
//   next = 0;
//   prev = (int)vReal[2];
//
//   for (int i = 3; i < 6; i++) {
//     curr = max((int)vReal[i], curr);
//   }
//
//   //   for (int i = 6; i < 11; i++) {
//   //     next = max((int)vReal[i], next);
//   //   }
//
//   if (prev > (curr * 0.47)) curr = 0;
//   // if (next > (curr * 0.4)) curr = 0;
//
//   //   Serial.printf("%6i\t%6i\t%6i\t", prev, curr, next);
//   curr -= FFT_LOW_CUTOFF;
//   if (curr < 0) curr = 0;
//
//   curr = constrain(curr, 0, FFT_HIGH_CUTOFF);
//   curr = map(curr, 0, FFT_HIGH_CUTOFF, 0, 255);
//   buckets[1] = (uint8_t)curr;
//
//   // ====================================================================
//   // 2: Midrange: 500 - 1 kHz
//   // prev = 0;
//   curr = 0;
//   // next = 0;
//
//   // for (int i = 2; i < 6; i++) {
//   //   prev = max((int)vReal[i], prev);
//   // }
//   //
//   for (int i = 6; i < 12; i++) {
//     curr = (vReal[i] > curr) ? vReal[i] : curr;
//   }
//   //
//   //   for (int i = 11; i < 21; i++) {
//   //     next = (vReal[i] > next) ? vReal[i] : next;
//   //   }
//   //
//   //   if (next > (curr * 0.36)) curr = 0;
//   //   if (prev > (curr * 2.68)) curr = 0;
//
//   // Serial.printf("%6i\t%6i\t%6i\t", prev, curr, next);
//   curr -= FFT_LOW_CUTOFF;
//   if (curr < 0) curr = 0;
//
//   curr = constrain(curr, 0, FFT_HIGH_CUTOFF);
//   curr = map(curr, 0, FFT_HIGH_CUTOFF, 0, 255);
//
//   buckets[2] = (uint8_t)curr;
//
//   // ====================================================================
//   // 3: Midrange: 1 - 2 kHz
//   curr = 0;
//   // next = 0;
//   // prev = 0;
//   //
//   //   for (int i = 2; i < 11; i++) {
//   //     prev = max((int)vReal[i], prev);
//   //   }
//   //
//   for (int i = 12; i < 24; i++) {
//     curr = max((int)vReal[i], curr);
//   }
//   //
//   //   for (int i = 21; i < 41; i++) {
//   //     next = max((int)vReal[i], next);
//   //   }
//   //
//   //   if (next > (curr * 0.29)) curr = 0;
//   //   if (prev > (curr * 2.84)) curr = 0;
//
//   //  Serial.printf("%6i\t%6i\t%6i\t", prev, curr, next);
//  curr -= FFT_LOW_CUTOFF;
//  if (curr < 0) curr = 0;
//
//  curr = constrain(curr, 0, FFT_HIGH_CUTOFF);
//  curr = map(curr, 0, FFT_HIGH_CUTOFF, 0, 255);
//
//  buckets[3] = (uint8_t)curr;
//
//  // ====================================================================
//  // 4: Upper Midrange: 2 - 4 kHz
//  curr = 0;
//  // next = 0;
//  //
//  //   for (int i = 11; i < 21; i++) {
//  //     prev = max((int)vReal[i], prev);
//  //   }
//  //
//  for (int i = 24; i < 48; i++) {
//    curr = max((int)vReal[i], curr);
//  }
//  //
//  //   for (int i = 41; i < 80; i++) {
//  //     next = max((int)vReal[i], next);
//  //   }
//  //
//  //   if (prev > (curr * 3.74)) curr = 0;
//  //   if (next > (curr * 0.30)) curr = 0;
//
//  //  Serial.printf("%6i\t%6i\t%6i\t", prev, curr, next);
//  curr -= FFT_LOW_CUTOFF;
//  if (curr < 0) curr = 0;
//
//  curr = constrain(curr, 0, FFT_HIGH_CUTOFF);
//  curr = map(curr, 0, FFT_HIGH_CUTOFF, 0, 255);
//
//  buckets[4] = (uint8_t)curr;
//
//  // ====================================================================
//  //   // 5: precence: 4 - 6 kHz
//  curr = 0;
//  // next = 0;
//  //
//  //   for (int i = 21; i < 40; i++) {
//  //     prev = max((int)vReal[i], prev);
//  //   }
//  //
//  for (int i = 48; i < 72; i++) {
//    curr = max((int)vReal[i], curr);
//  }
//  //
//  //   for (int i = 60; i < 240; i++) {
//  //     next = max((int)vReal[i], next);
//  //   }
//  //
//  //   if (prev > (curr * 1.10)) curr = 0;
//  //   if (next > (curr * 0.86)) curr = 0;
//
//  //   Serial.printf("%6i\t%6i\t%6i\t", prev, curr, next);
//  curr -= FFT_LOW_CUTOFF;
//  if (curr < 0) curr = 0;
//
//  curr = constrain(curr, 0, FFT_HIGH_CUTOFF);
//  curr = map(curr, 0, FFT_HIGH_CUTOFF, 0, 255);
//
//  buckets[5] = (uint8_t)curr;
//
//   // ====================================================================
//   // 6: Brilliance: 6 - 20 kHz kHz
//   curr = 0;
//   // next = 0;
//   //
//   //   for (int i = 40; i < 60; i++) {
//   //     prev = max((int)vReal[i], prev);
//   //   }
//   //
//   for (int i = 71; i < 240; i++) {
//     curr = max((int)vReal[i], curr);
//   }
//   //
//   //   if (prev > (curr * 1.30)) curr = 0;
//
//   // Serial.printf("%6i\t%6i\t%6i\t", prev, curr, next);
//   curr -= FFT_LOW_CUTOFF;
//   if (curr < 0) curr = 0;
//
//   curr = constrain(curr, 0, FFT_HIGH_CUTOFF);
//   curr = map(curr, 0, FFT_HIGH_CUTOFF, 0, 255);
//
//   buckets[6] = (uint8_t)curr;
//
//   // ====================================================================
//   // Debug printing:
//   // ====================================================================
//   // int FROM = 70;
//   // int TO = 175;
//   // int MOD = 2;
//   //
//   //   for (int i = FROM; i < TO; i++) {
//   //     if (i % MOD == 0) Serial.printf("%6i\t", (int)vReal[i]);
//   //   }
//   //   Serial.println();
//   //
//   //   EVERY_N_MILLIS(1000) {
//   //     Serial.println();
//   //     Serial.printf("%6s\t%6s\t%6s\t", "prev", "curr", "next");
//   //
//   //     for (int i = FROM; i < TO; i++) {
//   //       if (i % MOD == 0) Serial.printf("%6i\t", i);
//   //     }
//   //     Serial.println();
//   //     for (int i = FROM; i < (TO + 3); i++) {
//   //       if (i % MOD == 0) Serial.printf("------\t");
//   //     }
//   //     Serial.println();
//   //   }
// }

// =====================================================================
// EFFECTS
// =====================================================================
void Effects::effectRainbow() {
  // fills the leds with rainbow colors
  fill_rainbow(leds, numberOfLeds, startHue, 2);
}

uint16_t GRAD_INDEX = 0;
CRGBPalette256 pal = Sunset_Real_gp;
uint8_t j = 0;

