tfmalt/esp32-led-bookshelf/lib/Effects/Effects.cpp
void Effects::effectGradient() {
  CRGBPalette256 palettes[6] = {RdYlBu_gp, Paired_07_gp, bhw1_05_gp,
                                summer_gp, gr65_hult_gp, Sunset_Real_gp};

  EVERY_N_SECONDS(30) {
    Serial.printf("  - effect Gradient #: %i\n", j);
    pal = palettes[j];
    j = (j < 5) ? j + 1 : 0;
  }

  uint8_t step = (256 / LED_COUNT);

  // EVERY_N_MILLIS(1000 / FPS) { GRAD_INDEX++; }
  EVERY_N_MILLIS(1000 / FPS) {
    GRAD_INDEX = beatsin16(2, 0, 257 * 8);
    fill_palette(leds, LED_COUNT, GRAD_INDEX, step, pal, 255, LINEARBLEND);
    // fill_palette(end, (LED_COUNT / 2) - 1, REV_INDEX, step, pal, 255,
    //              LINEARBLEND);
    // end = start;
  }
}

void Effects::effectRainbowByShelf() {
  CRGBSet ledset(leds, numberOfLeds);
  ledset(0, 63).fill_rainbow(startHue, 4);
  ledset(64, 127) = ledset(63, 0);

  if (numberOfLeds < 131) return;

  ledset(128, 191).fill_rainbow(startHue + 64, 4);
  ledset(192, 255) = ledset(191, 128);

  if (numberOfLeds < 257) return;

  ledset(256, 319).fill_rainbow(startHue + 128, 4);
  ledset(320, 383) = ledset(319, 256);
}

void Effects::addGlitter(fract8 chanceOfGlitter) {
  if (random8() < chanceOfGlitter) {
    leds[random16(numberOfLeds)] += CRGB::White;
  }
}

void Effects::effectGlitterRainbow() {
  // built-in FastLED rainbow, plus some random sparkly glitter
  effectRainbow();
  EVERY_N_MILLIS(1000 / FPS) { addGlitter(160); }
}

void Effects::effectConfetti() {
  // random colored speckles that blink in and fade smoothly
  EVERY_N_SECONDS(2) { confettiHue = confettiHue + 8; }

  EVERY_N_MILLIS(1000 / FPS) {
    fadeToBlackBy(leds, numberOfLeds, 20);
    int pos = random16(numberOfLeds);
    // leds[pos] += CHSV(startHue + random8(64), 200, 255);
    leds[pos] += CHSV(confettiHue + random8(64), 200, 255);
    // leds[pos] += CHSV(confettiHue, 200, 255);
  }
}

// a colored dot sweeping back and forth, with fading trails
void Effects::effectSinelon() {
  EVERY_N_MILLIS(8) { fadeToBlackBy(leds, LED_COUNT, 16); }

  EVERY_N_MILLIS(200) { startHue += 1; }
  // LightState state = lightState->getCurrentState();

  // calculate a suiting pulserate for the number of leds.
  uint8_t bpm = 750 / LED_COUNT;

  int pos = beatsin16(bpm, 0, LED_COUNT - 1);
  leds[pos] = CHSV(startHue, 255, 255);
  // leds[pos] += CRGB(state.color.r, state.color.g, state.color.b);
}

/**
 * colored stripes pulsing at a defined Beats-Per-Minute (BPM)
 */
void Effects::effectBPM() {
  uint8_t BeatsPerMinute = 64;
  CRGBPalette16 palette = PartyColors_p;
  uint8_t beat = beatsin8(BeatsPerMinute, 64, 255);
  for (int i = 0; i < numberOfLeds; i++) {  // 9948
    leds[i] = ColorFromPalette(palette, startHue + (i * 2),
                               beat - startHue + (i * 10));
  }
}

void Effects::effectPride() {
  CRGBSet ledset(leds, LED_COUNT);

  uint8_t num_colors = 6;
  uint8_t segment = LED_COUNT / num_colors;

  uint32_t colors[num_colors] = {0xEF0000, 0xFF4000, 0xFFEF00,
                                 0x008000, 0x0000F0, 0x800070};

  for (int i = 0; i < num_colors; i++) {
    ledset(i * segment, (i * segment) + segment) = colors[i];
  }
}

void Effects::effectWalkingRainbow() {
  EVERY_N_SECONDS(2) {
    Serial.printf("  - Running Walking Rainbow: %i\n", startHue);
  }

  EVERY_N_MILLIS(1000 / 60) {
    uint8_t inc = 2;  // 256 / LED_COUNT;
    uint8_t hue = startHue;

    for (int i = 0; i < LED_COUNT; i++) {
      hue += inc;
      leds[i] = CHSV(hue, 255, 255);
    }

    startHue--;
  }
}

void Effects::effectColorloop() {
  // EVERY_N_SECONDS(2) { Serial.printf("  - Running colorloop: %i\n",
  // startHue); }

  EVERY_N_MILLIS(1000 / 10) {
    CRGBSet ledset(leds, LED_COUNT);
    startHue += 1;
    ledset = CHSV(startHue, 255, 255);
  }
}

/** =====================================================================
 * FFT based spectrum analyzer disco lights
 */
void Effects::effectVUMeter() {
  CRGBSet ledset(leds, LED_COUNT);

  EVERY_N_MILLIS(1000 / 25) {
    ledset(0, LED_COUNT).fadeToBlackBy(96);
    std::array<uint8_t, FFT_BUCKETS> buckets = fft.getSampleSet();

    // ==================================================================
    // Paint the colors
    CRGBPalette16 palette = Rainbow_gp;
    uint8_t segment = LED_COUNT / FFT_BUCKETS;  // how many leds per bucket
    uint8_t step = 256 / FFT_BUCKETS;    // How many colors to jump per segment
    uint8_t increment = step / segment;  // colors to increment inside segment

    for (int i = 0; i < FFT_BUCKETS; i++) {
      // map the value into number of leds to light.
      uint8_t count = map(buckets[i], 0, 255, 0, segment);

      if (count > 0) {
        fill_palette(ledset(i * segment, i * segment + count), count, i * step,
                     increment, palette, buckets[i], LINEARBLEND);
      }
      // buckets[i] = 0;
    }
  }
}

CRGBPalette256 colPal = Sunset_Real_gp;
void Effects::effectMusicDancer() {
  CRGBSet ledset(leds, LED_COUNT);
  // ledset(0, LED_COUNT) = CRGB::Black;

  std::array<uint8_t, FFT_BUCKETS> buckets = fft.getSampleSet();
  //   fftComputeSampleset();
  //   fftFillBuckets();

  uint16_t middle = LED_COUNT / 2;

  uint16_t bass_size = LED_COUNT / 10;
  uint16_t mid_size = LED_COUNT / 10;
  // uint16_t low_size = LED_COUNT / 10;

  uint16_t bass_amp = map(buckets[0], 0, 255, 0, ((LED_COUNT / 10) * 2));
  uint16_t mid_amp = map(buckets[2], 0, 255, 0, ((LED_COUNT / 10) * 2));
  uint16_t low_amp = map(buckets[3], 0, 255, 0, (LED_COUNT / 2));
  uint16_t high_amp = map(buckets[4], 0, 255, 0, (LED_COUNT / 2));
  uint16_t bril_amp = map(buckets[5], 0, 255, 0, LED_COUNT);
  uint16_t air_amp = map(buckets[6], 0, 255, 0, LED_COUNT);

  uint16_t bass_start = middle - bass_size;
  uint16_t bass_stop = middle + bass_size;

  uint16_t mid_start = bass_start - mid_size;
  uint16_t mid_stop = bass_stop + mid_size;

  ledset.fadeToBlackBy(48);
  // ledset.fadeLightBy(48);

  // CRGBPalette16 colPal = bhw1_05_gp;
  // CRGBPalette16 colPal = Paired_07_gp;  // bhw1_05_gp
  // CRGBPalette16 colPal = Rainbow_gp;  // bhw1_05_gp
  // CRGBPalette256 colPal = Sunset_Real_gp;
  CRGBPalette256 palettes[6] = {RdYlBu_gp, Paired_07_gp, bhw1_05_gp,
                                summer_gp, gr65_hult_gp, Sunset_Real_gp};

