tfmalt/esp32-led-bookshelf/lib/Effects/Effects.cpp
  EVERY_N_SECONDS(30) {
    Serial.printf("  - effect Gradient #: %i\n", j);
    colPal = palettes[j];
    j = (j < 5) ? j + 1 : 0;
  }

  uint8_t RAND = 32;

  for (int i = 0; i < high_amp; i++) {
    uint16_t pos = random16(LED_COUNT);
    // leds[pos] = CHSV(96 + random8(16), 255, buckets[4]);
    leds[pos] = ColorFromPalette(colPal, 223 + random8(RAND));
  }

  for (int i = 0; i < bril_amp; i++) {
    uint16_t pos = random16(LED_COUNT);
    // leds[pos] = CHSV(128 + random8(16), 255, buckets[5]);
    leds[pos] = ColorFromPalette(colPal, 192 + random8(RAND));
  }

  for (int i = 0; i < air_amp; i++) {
    uint16_t pos = random16(LED_COUNT);
    // leds[pos] = CHSV(192 + random8(16), 128, buckets[6]);
    leds[pos] = ColorFromPalette(colPal, 144 + random8(RAND));
  }

  for (int i = 0; i < low_amp; i++) {
    uint16_t pos = random16(LED_COUNT);
    leds[pos] = ColorFromPalette(colPal, 96 + random8(RAND));
    // leds[pos] = CHSV(144 + random8(16), 255, buckets[3]);
  }

  for (int i = 0; i < mid_amp; i++) {
    uint16_t pos = random16(mid_start, mid_stop);
    // leds[pos] = CHSV(24 + random8(32), 255, buckets[2]);
    leds[pos] = ColorFromPalette(colPal, 48 + random8(RAND));
  }

  for (int i = 0; i < bass_amp; i++) {
    uint16_t pos = random16(bass_start, bass_stop);
    // leds[pos] = CHSV(248 + random8(16), 255, buckets[0]);
    leds[pos] = ColorFromPalette(colPal, 0 + random8(RAND));
  }
}

uint8_t freqBuckets[LED_COUNT];
void Effects::effectFrequencies() {
  EVERY_N_SECONDS(10) { Serial.println("  - effect: display frequencies"); }

  CRGBSet ledset(leds, LED_COUNT);

  ledset(0, LED_COUNT) = CRGB::Black;
}

/**
 * eight colored dots, weaving in and out of sync with each other
 */
void Effects::effectJuggle() {
  EVERY_N_MILLIS(1000 / FPS) {
    fadeToBlackBy(leds, numberOfLeds, 20);
    byte dothue = 0;
    for (int i = 0; i < 8; i++) {
      leds[beatsin16(i + 7, 0, numberOfLeds - 1)] |= CHSV(dothue, 200, 255);
      dothue += 32;
    }
  }
}